[
    {
      "id": 1,
      "src": "/projects/limit-design.png",
      "name": "Limit Design ltd",
      "stack": [
        "/techStack/react.png",
        "/techStack/Bootstrap.png",
        "/techStack/css.png",
        "/techStack/firebase.png",
        "/techStack/Scss.png"
      ],
      "description": "Developed a modern and responsive portfolio website for Limit Design Ltd, an architecture firm, using React.js, CSS, SCSS, and Bootstrap to ensure a visually appealing and user-friendly interface. The website features seamless authentication powered by Firebase Auth and utilizes Firestore as the database for efficient data management. This project showcases the firm's architectural work while providing an intuitive and engaging user experience. ",
      "link":"https://limit-design-ltd.netlify.app/"

      
    },
    {
      "id": 2,
      "src": "/projects/zentry.jpeg",
      "name": "Zentry",
      "stack": [
        "/techStack/react.png",
        "/techStack/GSAP.png",
        "/techStack/css.png",
        "/techStack/Tailwind.png",
        "/techStack/frameMotion.png"
      ],
      "description": "A highly interactive and visually dynamic website for a game, utilizing React.js, GSAP, CSS, Tailwind CSS, and Framer Motion to create a seamless and engaging user experience. The website features advanced animations and interactive elements, enhancing user immersion and bringing the game's essence to life. This project showcases a high level of creativity and technical expertise in front-end development and motion design.",
      "link":"https://rezentry.netlify.app/",
      "github":"https://github.com/Yousuf-Mohammad/zentry"
      
    },
    {
      "id": 3,
      "src": "/projects/iphone.jpeg",
      "name": "Iphone-threeJS",
     
      "stack": [
        "/techStack/react.png",
        "/techStack/three-js-seeklogo.png",
        "/techStack/GSAP.png",
        "/techStack/css.png",
        "/techStack/Scss.png",
        "/techStack/Tailwind.png"

      ],
      "description": "Visually immersive website using React.js, GSAP, CSS, SCSS, Tailwind CSS, and Three.js, integrating advanced animations and interactive elements. The website features 3D object rendering, enhancing user engagement and delivering a unique, dynamic experience. This project demonstrates expertise in front-end development, animation, and 3D web technologies.",
      "link":"https://iphone-threejs.netlify.app/",
      "github":"https://github.com/Yousuf-Mohammad/iphone-threeJS"
      
    },
    {
      "id": 4,
      "src": "/projects/poruaAI.jpeg",
      "name": "Porua AI",
      "stack": [
        "/techStack/next.png",
        "/techStack/Tailwind.png",
        "/techStack/Clerk_idOESnvCPd_0.png",
        "/techStack/LangChain_id12EQi2QW_0.png",
        "/techStack/convex.png",
        "/techStack/frameMotion.png",
        "/techStack/shadcn-ui-seeklogo.png"
      ],
      "description": "I developed an AI-powered web application that extracts and organizes notes from PDF files, enhancing productivity and information retrieval. Built with Next.js, Tailwind CSS, ShadCN, and Framer Motion, the app offers a seamless and visually appealing user experience. Clerk is integrated for secure authentication, while Gemini AI and LangChain power the AI-driven note extraction and processing capabilities. This project showcases expertise in AI integration, modern front-end development, and user-centric design",
      "link":"https://porua-ai.vercel.app/",
      "github":"https://github.com/Yousuf-Mohammad/PoruaAI/"
      
    },
    {
      "id": 5,
      "src": "/projects/musafir.jpeg",
      "name": "Musafirs Den",
      "stack": "ReactJS, NodeJS, ExpressJS, Mongoose, MongoDB, MulterJS, Bcrypt, JWT",
      "stack": [
        "/techStack/react.png",
        "/techStack/Bootstrap.png",
        "/techStack/css.png",
        "/techStack/nodeJS.png",
        "/techStack/Express.png",
        "/techStack/Mongo.png",
        "/techStack/Redux.png",
        "/techStack/jwt.png"
      ],
      "description": "Developed a feature-rich e-commerce website tailored for travelers, offering a wide range of adventure tours and travel equipment. The platform is built using React.js, Redux, Bootstrap, and CSS to deliver an interactive and user-friendly shopping experience.For the backend, I implemented Node.js and Express.js, connected to MongoDB for efficient data management. Authentication is secured using JWT and bcrypt, ensuring a safe and seamless user experience. This project highlights expertise in full-stack web development, secure authentication, and e-commerce functionality",
      "link":"https://musafirs-den.onrender.com/",
      "github":"https://github.com/Yousuf-Mohammad/MusafirDen"
      
    },
    {
      "id": 6,
      "src": "/projects/bangkok.jpeg",
      "name": "Bangkok Hospital",
      "stack": "NextJs, TailwindCSS, Redux, Laravel, MySQL,InertiaJS",
      "stack": [
        "/techStack/next.png",
        "/techStack/Tailwind.png",
        "/techStack/Redux.png",
        "/techStack/Laravel.png",
        "/techStack/MySQL.png"

      ],
      "description": "Developed a modern and responsive medical website using Next.js, Tailwind CSS, and Redux, providing detailed information about the hospital's services and enabling users to book appointments seamlessly. The platform is designed for an intuitive user experience, ensuring accessibility and efficiency for patients seeking medical consultations and various healthcare services. This project demonstrates expertise in front-end development, state management, and user-centric design.",
      "link":"https://www.bangkokhospital.com/en"
      
    }
   
   
  ]